Certification/src/InformationRegisters/ЦветаРасписанияЛК/ЦветаРасписанияЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦветаРасписанияЛК</name>
  <resources>
    <name>ЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦветТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИтоговыйСтатус</name>
    <type>
      <types>EnumRef.ИтоговыеСтатусыРасписанияЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Работы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Certification/src/InformationRegisters/ЦветаРасписанияЛК/Forms/ФормаСписка/Module.bsl
//==================================================================================================
#Область СобытияФормы
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапольнитьТД();
	
КонецПроцедуры

#КонецОбласти


//==================================================================================================
#Область СобытияЭлементовФормы
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


#КонецОбласти


//==================================================================================================
#Область СобытияИмяТабличнойЧасти
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ


#КонецОбласти


//==================================================================================================
#Область СобытияОбщегоНазначения
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗапольнитьТД()
	ТД = РегистрыСведений.ЦветаРасписанияЛК.ПолучитьТабДокЛегенды(); 
КонецПроцедуры


&НаКлиенте
Процедура ТДОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ИтоговыйСтатус"	, Расшифровка.ИтоговыйСтатус);
	ПараметрыФормы.Вставить("Работа"			, Расшифровка.Работа);
	ПараметрыФормы.Вставить("ЦветТекста"		, Элемент.ТекущаяОбласть.ЦветТекста);
	ПараметрыФормы.Вставить("ЦветФона"			, Элемент.ТекущаяОбласть.ЦветФона);
	
	Результат = ОткрытьФормуМодально("РегистрСведений.ЦветаРасписанияЛК.Форма.ФормаВыбораОформления", ПараметрыФормы); 
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаписатьВРегистр(Расшифровка.ИтоговыйСтатус, Расшифровка.Работа, Результат.ЦветТекста, Результат.ЦветФона);
		//
		Если ЗначениеЗаполнено(Расшифровка.Работа) Тогда
			Элемент.ТекущаяОбласть.ЦветТекста	= Результат.ЦветТекста;
			Элемент.ТекущаяОбласть.ЦветФона		= Результат.ЦветФона;
		Иначе
			// Перерисуем весь таб документ - надо переоформить вся строку 
			ЗапольнитьТД();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВРегистр(ИтоговыйСтатус, Работа, ЦветТекста, ЦветФона)
	
	ЦветТекстаСтрокой	= БоР_ОбщийМодуль.ЗначениеВXML(ЦветТекста);
	ЦветФонаСтрокой		= БоР_ОбщийМодуль.ЗначениеВXML(ЦветФона);

	
	// Проверим установки в целом для ИтоговыйСтатус. Если совпадает то не будем добавлять
	ЗаписьРС = РегистрыСведений.ЦветаРасписанияЛК.СоздатьМенеджерЗаписи();
	ЗаписьРС.ИтоговыйСтатус	= ИтоговыйСтатус;
	ЗаписьРС.Работа			= Справочники.Работы.ПустаяСсылка();
	ЗаписьРС.Прочитать();
	Если ЗаписьРС.ЦветТекста = ЦветТекстаСтрокой И ЗаписьРС.ЦветФона = ЦветФонаСтрокой Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьРС = РегистрыСведений.ЦветаРасписанияЛК.СоздатьМенеджерЗаписи();
	ЗаписьРС.ИтоговыйСтатус	= ИтоговыйСтатус;
	ЗаписьРС.Работа			= Работа;
	ЗаписьРС.ЦветТекста		= ЦветТекстаСтрокой;
	ЗаписьРС.ЦветФона		= ЦветФонаСтрокой;
	ЗаписьРС.Записать(Истина);

КонецПроцедуры


#КонецОбласти


//==================================================================================================
